---
kind: type
id: T:Autodesk.Revit.DB.Macros.ApplicationMacroOptions
source: html/f2e09bb1-8f51-089d-dc36-c76c9a1fb683.htm
---
# Autodesk.Revit.DB.Macros.ApplicationMacroOptions

The application macro options.

## Syntax (C#)
```csharp
public enum ApplicationMacroOptions
```